
********************* Informações *********************

Arquiteura:			Lenet Model
Teste:				0.2
Validação:			0.99
Número de repetições:		5
Número de épocas:		100
Semente do modelo:		True
Tempo total de processamento:	3:33:19.053570 h
Tempo médio de processamento:	0:42:39.810714 h

*********************** Métricas ***********************

Acurácia média:			0.6653714285714286
AUC média:			0.6655641347404415

Matriz de confusão somada:

[[24881  9979]
 [13445 21695]]

****************** Arquitetura gerada ******************

Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_9 (Conv2D)            (None, 52, 113, 6)        168       
_________________________________________________________________
average_pooling2d_9 (Average (None, 26, 56, 6)         0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 24, 54, 16)        880       
_________________________________________________________________
average_pooling2d_10 (Averag (None, 12, 27, 16)        0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 5184)              0         
_________________________________________________________________
dense_13 (Dense)             (None, 120)               622200    
_________________________________________________________________
dense_14 (Dense)             (None, 84)                10164     
_________________________________________________________________
dense_15 (Dense)             (None, 2)                 170       
=================================================================
Total params: 633,582
Trainable params: 633,582
Non-trainable params: 0
_________________________________________________________________
